## `terraform/scheduling`
#### Terraform Format and Style 🖌`'No changes needed.'`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.custom_lambda.module.user_action_filter_function.data.external.archive_prepare[0]: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.assume_role[0]: Reading...
data.aws_sns_topic.my_sns: Reading...
data.aws_kms_key.my_kms: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_caller_identity.current: Reading...
module.custom_domain.data.aws_route53_zone.mydomain: Reading...
data.aws_vpc.myvpc: Reading...
module.custom_nlb.module.nlb.data.aws_partition.current: Reading...
module.custom_lambda.module.user_action_filter_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/user-action-filter-function]
module.custom_cloudwatch.aws_cloudwatch_log_group.firelens: Refreshing state... [id=/aws/ecs/minecraft-firelens-logs]
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.custom_nlb.module.nlb.data.aws_partition.current: Read complete after 0s [id=aws]
module.custom_domain.aws_cloudfront_origin_access_control.s3_origin_access_control: Refreshing state... [id=E2KLHUQD90RTJ9]
module.custom_lambda.module.user_action_filter_function.data.aws_region.current: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
data.aws_iam_role.task_role: Reading...
data.aws_iam_role.task_role: Read complete after 0s [id=ecs_tasks-minecraft-test-role]
data.aws_security_group.fargate_sg: Reading...
module.custom_ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:528163014577:cluster/minecraft-test-cluster]
module.custom_lambda.module.user_action_filter_function.data.external.archive_prepare[0]: Read complete after 1s [id=-]
data.aws_iam_role.task_execution_role: Reading...
module.custom_domain.data.aws_route53_zone.mydomain: Read complete after 0s [id=Z006257634KDWA8TCRYLE]
module.custom_domain.data.aws_s3_bucket.dynmap_bucket: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_caller_identity.current: Read complete after 0s [id=528163014577]
module.custom_lambda.module.user_action_filter_function.data.aws_partition.current: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.custom_domain.data.aws_cloudfront_cache_policy.optimized: Reading...
data.aws_iam_role.task_execution_role: Read complete after 0s [id=minecraft-test-ecs_tasks_execution-role]
module.custom_lambda.module.user_action_filter_function.aws_iam_role.lambda[0]: Refreshing state... [id=user-action-filter-function]
module.custom_domain.data.aws_cloudfront_cache_policy.optimized: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
module.custom_lambda.module.user_action_filter_function.local_file.archive_plan[0]: Refreshing state... [id=421827469ade4a6f146fa8ac3fc4b3f8da27703b]
module.custom_lambda.module.user_action_filter_function.null_resource.archive[0]: Refreshing state... [id=2148606210614592634]
data.aws_kms_key.my_kms: Read complete after 1s [id=fbe3a2e1-dee7-431a-8206-9cd2092c08df]
data.aws_sns_topic.my_sns: Read complete after 1s [id=arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic]
module.custom_lambda.module.user_action_filter_function.aws_iam_policy.additional_json[0]: Refreshing state... [id=arn:aws:iam::528163014577:policy/user-action-filter-function]
module.custom_lambda.module.user_action_filter_function.aws_iam_role_policy_attachment.additional_json[0]: Refreshing state... [id=user-action-filter-function-20240624234043480900000005]
module.custom_ecs.aws_ecs_task_definition.main: Refreshing state... [id=minecraft-test]
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.logs[0]: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1875139620]
module.custom_lambda.module.user_action_filter_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::528163014577:policy/user-action-filter-function-logs]
data.aws_security_group.fargate_sg: Read complete after 1s [id=sg-07934f64784cd1b97]
module.custom_lambda.module.user_action_filter_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=user-action-filter-function-20240624234043424500000004]
module.custom_lambda.module.user_action_filter_function.aws_lambda_function.this[0]: Refreshing state... [id=user-action-filter-function]
module.custom_domain.data.aws_s3_bucket.dynmap_bucket: Read complete after 1s [id=minecraft-dynmaps]
module.custom_domain.aws_s3_bucket_public_access_block.dynmap_bucket: Refreshing state... [id=minecraft-dynmaps]
module.custom_domain.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E3EB67M0BSYO03]
module.custom_domain.aws_route53_record.dynmap_dns: Refreshing state... [id=Z006257634KDWA8TCRYLE_dynmap.smat710.com_A]
module.custom_domain.data.aws_iam_policy_document.s3_main_policy: Reading...
module.custom_domain.data.aws_iam_policy_document.s3_main_policy: Read complete after 0s [id=1138553640]
module.custom_domain.aws_s3_bucket_policy.allow_access_from_cloudfront: Refreshing state... [id=minecraft-dynmaps]
data.aws_vpc.myvpc: Read complete after 2s [id=vpc-080b3749ba65ae3d7]
data.aws_subnets.my_subnets: Reading...
module.custom_nlb.module.nlb.aws_security_group.this[0]: Refreshing state... [id=sg-0af15b9a06c74bf93]
module.custom_nlb.module.nlb.aws_lb_target_group.this["ex-target-one"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:targetgroup/tf-20240624234041763700000002/ed621ae18a9897e6]
module.custom_lambda.aws_lambda_permission.log_permission: Refreshing state... [id=terraform-20240624234057473000000007]
module.custom_lambda.aws_cloudwatch_log_subscription_filter.user-action_subscription["1"]: Refreshing state... [id=cwlsf-384885153]
module.custom_lambda.aws_cloudwatch_log_subscription_filter.user-action_subscription["0"]: Refreshing state... [id=cwlsf-384885153]
data.aws_subnets.my_subnets: Read complete after 0s [id=ap-northeast-1]
module.custom_nlb.module.nlb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:loadbalancer/net/minecraft-test-nlb/f85438ff4deeb0d2]
module.custom_ecs.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:528163014577:service/minecraft-test-cluster/minecraft-test-service]
module.custom_nlb.null_resource.send_slack_notification: Refreshing state... [id=916082285948606521]
module.custom_nlb.module.nlb.aws_lb_listener.this["ex-one"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:listener/net/minecraft-test-nlb/f85438ff4deeb0d2/141cba1c74acfab9]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.target_group_health_check: Refreshing state... [id=minecraft-test-targetgroup_healthy]
module.custom_domain.aws_route53_record.apps_dns: Refreshing state... [id=Z006257634KDWA8TCRYLE_minecraft.smat710.com_A]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.memory_utilization: Refreshing state... [id=minecraft-test-memory_utilization]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.cpu_utilization: Refreshing state... [id=minecraft-test-cpu_utilization]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.task_running_count: Refreshing state... [id=minecraft-test-task_running_count]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.custom_ecs.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:528163014577:task-definition/minecraft-test:182" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-1:528163014577:task-definition/minecraft-test" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "minecraft-test" -> (known after apply)
      ~ revision                 = 182 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (9 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "data" -> null
        }
      - volume {
          - configure_at_launch = false -> null
          - name                = "log-volume" -> null
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "data"
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "log-volume"
        }
    }

  # module.custom_lambda.module.user_action_filter_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "user-action-filter-function"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:528163014577:function:user-action-filter-function:74" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:528163014577:function:user-action-filter-function:74/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "74" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "WEB_HOOK_URL"  = (sensitive value)
                # (2 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>